Customer_Product_Purchase_Classification through KNN (Whether a person will purchase a product through ads or not)

In [9]:
#Data gathering
#1.importing libraries
import numpy as np
import pandas as pd

In [10]:
#2.loading and reading data
df=pd.read_csv('/content/Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [11]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [13]:
#Data Preprocessing
#1.drop User ID as it does not influence in purchase, only helps in tracking
df1=df.drop(['User ID'],axis=1)

In [14]:
df1.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [15]:
#2.Convert the categorical column 'Gender' into numerical column using one hot encoding
df1['Gender'] = df1['Gender'].apply({'Male':0,'Female':1}.get)
df1.head()

   Gender  Age  EstimatedSalary  Purchased
0       0   19            19000          0
1       0   35            20000          0
2       1   26            43000          0
3       1   27            57000          0
4       0   19            76000          0

In [16]:
#3.Splitting the data set into dependent and independent columns
x=df1[['Gender','Age','EstimatedSalary']]
y=df1['Purchased']

In [17]:
x.head()

   Gender  Age  EstimatedSalary
0       0   19            19000
1       0   35            20000
2       1   26            43000
3       1   27            57000
4       0   19            76000

In [18]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [19]:
#4.Splitting the data into training and testing set
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [20]:
#Model Building KNN
from sklearn.neighbors import KNeighborsClassifier
classifier = KNeighborsClassifier(n_neighbors = 5)#k=5
classifier.fit(x_train,y_train)
y_pred = classifier.predict(x_test)

In [21]:
#Confusion Matrix
from sklearn.metrics import confusion_matrix,accuracy_score
cm = confusion_matrix(y_test,y_pred)
ac = accuracy_score(y_test,y_pred)
print(cm)
print(ac)

[[45  9]
 [ 8 18]]
0.7875

In [22]:
#New_Data
data_new = {'Gender':1,'Age':25,'EstimatedSalary':15000}
index=[1]
new_cust=pd.DataFrame(data_new,index)
new_cust
predictions_new = classifier.predict(new_cust)
print("Output of classification for the new customer is ",predictions_new)

Output of classification for the new customer is  [0]